models/deepseek-v2-lite-2p2d/benchmark_results/p50_2p2d_20260317_234448/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7699c4384fe0>, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_2p2d_20260317_234448', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-24c39428-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-17 23:45:09 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:37<00:00,  2.70it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  37.02     
Total input tokens:                      1386900   
Total generated tokens:                  25200     
Request throughput (req/s):              2.70      
Output token throughput (tok/s):         680.71    
Peak output token throughput (tok/s):    1060.00   
Peak concurrent requests:                72.00     
Total token throughput (tok/s):          38143.83  
---------------Time to First Token----------------
Mean TTFT (ms):                          5021.88   
Median TTFT (ms):                        5252.05   
P50 TTFT (ms):                           5252.05   
P90 TTFT (ms):                           7873.74   
P95 TTFT (ms):                           7944.96   
P99 TTFT (ms):                           8104.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.40     
Median TPOT (ms):                        36.63     
P50 TPOT (ms):                           36.63     
P90 TPOT (ms):                           40.30     
P95 TPOT (ms):                           41.54     
P99 TPOT (ms):                           41.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.40     
Median ITL (ms):                         36.23     
P50 ITL (ms):                            36.23     
P90 ITL (ms):                            38.60     
P95 ITL (ms):                            39.80     
P99 ITL (ms):                            44.21     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          14408.06  
Median E2EL (ms):                        14399.15  
P50 E2EL (ms):                           14399.15  
P90 E2EL (ms):                           16941.27  
P95 E2EL (ms):                           17014.23  
P99 E2EL (ms):                           17107.60  
==================================================